<details>
<summary>Execution result of "plan" in "products/example-product"</summary>

```terraform
14:41:06.497 WARN   Config ../../teams/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
14:41:06.500 INFO   Downloading Terraform configurations from ../.. into ./.terragrunt-cache/dIsKhLw6PcBbMpKBkL6b5pZ5I5o/t5OMVj_I0gH6gyEgAooapNQ8rGU
14:41:06.604 INFO   terraform: Initializing the backend...
14:41:07.647 INFO   terraform: 
14:41:07.647 INFO   terraform: Successfully configured the backend "s3"! Terraform will automatically
14:41:07.648 INFO   terraform: use this backend unless the backend configuration changes.
14:41:07.882 INFO   terraform: Initializing provider plugins...
14:41:07.882 INFO   terraform: - Finding latest version of hashicorp/github...
14:41:08.036 INFO   terraform: - Installing hashicorp/github v6.11.1...
14:41:08.308 INFO   terraform: - Installed hashicorp/github v6.11.1 (signed by HashiCorp)
14:41:08.308 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
14:41:08.308 INFO   terraform: selections it made above. Include this file in your version control repository
14:41:08.308 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
14:41:08.308 INFO   terraform: you run "terraform init" in the future.
14:41:08.308 INFO   terraform: ╷
14:41:08.308 INFO   terraform: │ Warning: Additional provider information from registry
14:41:08.308 INFO   terraform: │ 
14:41:08.308 INFO   terraform: │ The remote registry returned warnings for
14:41:08.308 INFO   terraform: │ registry.terraform.io/hashicorp/github:
14:41:08.309 INFO   terraform: │ - For users on Terraform 0.13 or greater, this provider has moved to
14:41:08.309 INFO   terraform: │ integrations/github. Please update your source in required_providers.
14:41:08.309 INFO   terraform: ╵
14:41:08.309 INFO   terraform: Terraform has been successfully initialized!
14:41:09.956 STDOUT terraform: data.github_team.teams["developers"]: Reading...
14:41:09.956 STDOUT terraform: data.github_team.teams["platform-engineering"]: Reading...
14:41:09.956 STDOUT terraform: data.github_team.teams["core-maintainers"]: Reading...
14:41:10.202 STDOUT terraform: Terraform used the selected providers to generate the following execution
14:41:10.202 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
14:41:10.202 STDOUT terraform:   + create
14:41:10.202 STDOUT terraform: Terraform planned the following actions, but then encountered a problem:
14:41:10.202 STDOUT terraform:   # github_repository.repos["example-library"] will be created
14:41:10.202 STDOUT terraform:   + resource "github_repository" "repos" {
14:41:10.202 STDOUT terraform:       + allow_auto_merge                        = false
14:41:10.202 STDOUT terraform:       + allow_forking                           = (known after apply)
14:41:10.202 STDOUT terraform:       + allow_merge_commit                      = true
14:41:10.203 STDOUT terraform:       + allow_rebase_merge                      = true
14:41:10.203 STDOUT terraform:       + allow_squash_merge                      = true
14:41:10.203 STDOUT terraform:       + archived                                = false
14:41:10.203 STDOUT terraform:       + default_branch                          = (known after apply)
14:41:10.203 STDOUT terraform:       + delete_branch_on_merge                  = false
14:41:10.203 STDOUT terraform:       + description                             = "Example library demonstrating configuration override hierarchy"
14:41:10.203 STDOUT terraform:       + etag                                    = (known after apply)
14:41:10.203 STDOUT terraform:       + fork                                    = (known after apply)
14:41:10.203 STDOUT terraform:       + full_name                               = (known after apply)
14:41:10.203 STDOUT terraform:       + git_clone_url                           = (known after apply)
14:41:10.203 STDOUT terraform:       + html_url                                = (known after apply)
14:41:10.203 STDOUT terraform:       + http_clone_url                          = (known after apply)
14:41:10.203 STDOUT terraform:       + id                                      = (known after apply)
14:41:10.203 STDOUT terraform:       + ignore_vulnerability_alerts_during_read = false
14:41:10.204 STDOUT terraform:       + merge_commit_message                    = "PR_TITLE"
14:41:10.204 STDOUT terraform:       + merge_commit_title                      = "MERGE_MESSAGE"
14:41:10.204 STDOUT terraform:       + name                                    = "example-library"
14:41:10.204 STDOUT terraform:       + node_id                                 = (known after apply)
14:41:10.204 STDOUT terraform:       + primary_language                        = (known after apply)
14:41:10.204 STDOUT terraform:       + private                                 = (known after apply)
14:41:10.204 STDOUT terraform:       + repo_id                                 = (known after apply)
14:41:10.204 STDOUT terraform:       + source_owner                            = (known after apply)
14:41:10.204 STDOUT terraform:       + source_repo                             = (known after apply)
14:41:10.204 STDOUT terraform:       + squash_merge_commit_message             = "COMMIT_MESSAGES"
14:41:10.204 STDOUT terraform:       + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
14:41:10.204 STDOUT terraform:       + ssh_clone_url                           = (known after apply)
14:41:10.205 STDOUT terraform:       + svn_url                                 = (known after apply)
14:41:10.205 STDOUT terraform:       + topics                                  = [
14:41:10.205 STDOUT terraform:           + "go",
14:41:10.205 STDOUT terraform:           + "sdk",
14:41:10.205 STDOUT terraform:           + "shared-library",
14:41:10.205 STDOUT terraform:         ]
14:41:10.205 STDOUT terraform:       + visibility                              = "internal"
14:41:10.205 STDOUT terraform:       + vulnerability_alerts                    = (known after apply)
14:41:10.205 STDOUT terraform:       + web_commit_signoff_required             = false
14:41:10.205 STDOUT terraform:       + security_and_analysis (known after apply)
14:41:10.205 STDOUT terraform:     }
14:41:10.205 STDOUT terraform:   # github_repository.repos["example-service"] will be created
14:41:10.205 STDOUT terraform:   + resource "github_repository" "repos" {
14:41:10.205 STDOUT terraform:       + allow_auto_merge                        = false
14:41:10.205 STDOUT terraform:       + allow_forking                           = (known after apply)
14:41:10.205 STDOUT terraform:       + allow_merge_commit                      = true
14:41:10.205 STDOUT terraform:       + allow_rebase_merge                      = true
14:41:10.205 STDOUT terraform:       + allow_squash_merge                      = true
14:41:10.206 STDOUT terraform:       + archived                                = false
14:41:10.206 STDOUT terraform:       + default_branch                          = (known after apply)
14:41:10.206 STDOUT terraform:       + delete_branch_on_merge                  = false
14:41:10.206 STDOUT terraform:       + description                             = "Example service repository demonstrating minimal configuration"
14:41:10.206 STDOUT terraform:       + etag                                    = (known after apply)
14:41:10.206 STDOUT terraform:       + fork                                    = (known after apply)
14:41:10.206 STDOUT terraform:       + full_name                               = (known after apply)
14:41:10.206 STDOUT terraform:       + git_clone_url                           = (known after apply)
14:41:10.206 STDOUT terraform:       + html_url                                = (known after apply)
14:41:10.206 STDOUT terraform:       + http_clone_url                          = (known after apply)
14:41:10.206 STDOUT terraform:       + id                                      = (known after apply)
14:41:10.206 STDOUT terraform:       + ignore_vulnerability_alerts_during_read = false
14:41:10.206 STDOUT terraform:       + merge_commit_message                    = "PR_TITLE"
14:41:10.206 STDOUT terraform:       + merge_commit_title                      = "MERGE_MESSAGE"
14:41:10.207 STDOUT terraform:       + name                                    = "example-service"
14:41:10.207 STDOUT terraform:       + node_id                                 = (known after apply)
14:41:10.207 STDOUT terraform:       + primary_language                        = (known after apply)
14:41:10.207 STDOUT terraform:       + private                                 = (known after apply)
14:41:10.207 STDOUT terraform:       + repo_id                                 = (known after apply)
14:41:10.207 STDOUT terraform:       + source_owner                            = (known after apply)
14:41:10.207 STDOUT terraform:       + source_repo                             = (known after apply)
14:41:10.207 STDOUT terraform:       + squash_merge_commit_message             = "COMMIT_MESSAGES"
14:41:10.207 STDOUT terraform:       + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
14:41:10.207 STDOUT terraform:       + ssh_clone_url                           = (known after apply)
14:41:10.207 STDOUT terraform:       + svn_url                                 = (known after apply)
14:41:10.207 STDOUT terraform:       + topics                                  = (known after apply)
14:41:10.207 STDOUT terraform:       + visibility                              = (known after apply)
14:41:10.208 STDOUT terraform:       + vulnerability_alerts                    = (known after apply)
14:41:10.208 STDOUT terraform:       + web_commit_signoff_required             = false
14:41:10.208 STDOUT terraform:       + security_and_analysis (known after apply)
14:41:10.208 STDOUT terraform:     }
14:41:10.208 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
14:41:10.208 STDOUT terraform: Changes to Outputs:
14:41:10.208 STDOUT terraform:   + repository_names = [
14:41:10.208 STDOUT terraform:       + "example-library",
14:41:10.208 STDOUT terraform:       + "example-service",
14:41:10.208 STDOUT terraform:     ]
14:41:10.208 STDOUT terraform:   + repository_urls  = {
14:41:10.208 STDOUT terraform:       + example-library = (known after apply)
14:41:10.208 STDOUT terraform:       + example-service = (known after apply)
14:41:10.208 STDOUT terraform:     }
14:41:10.208 STDERR terraform: ╷
14:41:10.208 STDERR terraform: │ Error: GET https://api.github.com/orgs/neteye-platform/teams/core-maintainers: 404 Not Found []
14:41:10.208 STDERR terraform: │ 
14:41:10.208 STDERR terraform: │   with data.github_team.teams["core-maintainers"],
14:41:10.208 STDERR terraform: │   on data.tf line 3, in data "github_team" "teams":
14:41:10.208 STDERR terraform: │    3: data "github_team" "teams" {
14:41:10.208 STDERR terraform: │ 
14:41:10.208 STDERR terraform: ╵
14:41:10.209 STDERR terraform: ╷
14:41:10.209 STDERR terraform: │ Error: GET https://api.github.com/orgs/neteye-platform/teams/developers: 404 Not Found []
14:41:10.209 STDERR terraform: │ 
14:41:10.209 STDERR terraform: │   with data.github_team.teams["developers"],
14:41:10.209 STDERR terraform: │   on data.tf line 3, in data "github_team" "teams":
14:41:10.209 STDERR terraform: │    3: data "github_team" "teams" {
14:41:10.209 STDERR terraform: │ 
14:41:10.209 STDERR terraform: ╵
14:41:10.209 STDERR terraform: ╷
14:41:10.209 STDERR terraform: │ Error: GET https://api.github.com/orgs/neteye-platform/teams/platform-engineering: 404 Not Found []
14:41:10.209 STDERR terraform: │ 
14:41:10.209 STDERR terraform: │   with data.github_team.teams["platform-engineering"],
14:41:10.209 STDERR terraform: │   on data.tf line 3, in data "github_team" "teams":
14:41:10.209 STDERR terraform: │    3: data "github_team" "teams" {
14:41:10.209 STDERR terraform: │ 
14:41:10.209 STDERR terraform: ╵
14:41:10.209 STDERR terraform: ╷
14:41:10.209 STDERR terraform: │ Error: Unsupported attribute
14:41:10.209 STDERR terraform: │ 
14:41:10.209 STDERR terraform: │   on locals.tf line 31, in locals:
14:41:10.209 STDERR terraform: │   31:         permission = team.permission
14:41:10.210 STDERR terraform: │ 
14:41:10.210 STDERR terraform: │ This object does not have an attribute named "permission".
14:41:10.210 STDERR terraform: ╵
14:41:10.210 STDERR terraform: ╷
14:41:10.210 STDERR terraform: │ Error: Missing required argument
14:41:10.210 STDERR terraform: │ 
14:41:10.210 STDERR terraform: │   with github_branch_protection.main["example-library"],
14:41:10.210 STDERR terraform: │   on main.tf line 48, in resource "github_branch_protection" "main":
14:41:10.210 STDERR terraform: │   48:   pattern       = each.value.branch_protection.pattern
14:41:10.210 STDERR terraform: │ 
14:41:10.210 STDERR terraform: │ The argument "pattern" is required, but no definition was found.
14:41:10.210 STDERR terraform: ╵
14:41:10.450 STDOUT terraform: ::error::Terraform exited with code 1.
14:41:10.456 ERROR  error occurred:

* Failed to execute "terraform plan" in ./.terragrunt-cache/dIsKhLw6PcBbMpKBkL6b5pZ5I5o/t5OMVj_I0gH6gyEgAooapNQ8rGU/modules/github-repos
  ╷
  │ Error: GET https://api.github.com/orgs/neteye-platform/teams/core-maintainers: 404 Not Found []
  │ 
  │   with data.github_team.teams["core-maintainers"],
  │   on data.tf line 3, in data "github_team" "teams":
  │    3: data "github_team" "teams" {
  │ 
  ╵
  ╷
  │ Error: GET https://api.github.com/orgs/neteye-platform/teams/developers: 404 Not Found []
  │ 
  │   with data.github_team.teams["developers"],
  │   on data.tf line 3, in data "github_team" "teams":
  │    3: data "github_team" "teams" {
  │ 
  ╵
  ╷
  │ Error: GET https://api.github.com/orgs/neteye-platform/teams/platform-engineering: 404 Not Found []
  │ 
  │   with data.github_team.teams["platform-engineering"],
  │   on data.tf line 3, in data "github_team" "teams":
  │    3: data "github_team" "teams" {
  │ 
  ╵
  ╷
  │ Error: Unsupported attribute
  │ 
  │   on locals.tf line 31, in locals:
  │   31:         permission = team.permission
  │ 
  │ This object does not have an attribute named "permission".
  ╵
  ╷
  │ Error: Missing required argument
  │ 
  │   with github_branch_protection.main["example-library"],
  │   on main.tf line 48, in resource "github_branch_protection" "main":
  │   48:   pattern       = each.value.branch_protection.pattern
  │ 
  │ The argument "pattern" is required, but no definition was found.
  ╵
  
  exit status 1
```

</details>
    
